In [1]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

connection = "mysql+pymysql://root:root@localhost/new_db"

In [2]:
# Create engine
engine = create_engine(connection)

In [4]:
# ELIF statement to check for existing database or create new one
if database_exists(connection) == False:
    create_database(connection)
else:
    print('Database already exists')

Database already exists

In [5]:
# Verify database was created
database_exists(connection)

True

In [10]:
# Turn pandas dataframe into table in mysql
import pandas as pd
df = pd.read_csv("C:\\Users\\hamma\\Documents\\DataEnrichment\\Data\\Tshirt.csv")
df.head()

  Size  Color  Cost Sold
0    S   Blue  5.00    Y
1    M    Red  7.49    Y
2    M  Green  8.00    N
3   XL  Green  4.00    N
4    L    Red  9.99    Y

In [11]:
df.to_sql('tshirts', engine, if_exists = 'replace')

9

In [12]:
# Make query
q = '''select * from tshirts limit 5;'''
pd.read_sql(q, engine)

   index Size  Color  Cost Sold
0      0    S   Blue  5.00    Y
1      1    M    Red  7.49    Y
2      2    M  Green  8.00    N
3      3   XL  Green  4.00    N
4      4    L    Red  9.99    Y

In [13]:
q = '''show tables'''
pd.read_sql(q, engine)

  Tables_in_new_db
0          tshirts